/* 
자바기초 : 자바 프로그램 구조
*/

// 클래스 선언

public class java_1{
    //변수 선언
    int num1;
    Message msg;

    // 메서드_1
    public void printName(String name){

    }
    // 메서드_2
    public Message getMessage(){

    }
    // 메인 메서드
    public static void main(String[] args){
        //클래스 인스턴스 생성
        MyClass mc = new MyClass();
    }
}

/*
클래스(Class)
객체지향 프로그램의 기본 구조로 자바에서 모든 프로그램 소스는 클래스 단위로 시작하게 됨
* 프로그램 소스는 .java 파일이고 컴파일된 결과는 .class
* 일반적으로 클래스 이름과 소스파일명은 동일함.
* 대부분의 경우 프로그램은 여러 클래스로 구성되며 실행을 위해서는 main() 메서드가 필요함

인스턴스(Instance)
클래스로부터 생성된 객체로 클래스는 객체를 정의한 틀이고 실제 프로그램은 인스턴스를 통해 동작하게 됨
* main() 메서드는 단지 프로그램을 실행하는 진입점이고 실제 클래스를 사용하려면 new() 연산을 통해 인스턴스를 생성해야됨
* main()에서 클래스부에 선언된 변수를 접근할 수 없으며 인스턴스를 통해 사용해야됨
* 인스턴스에서 변수와 메서드 사용은 인스턴스명 변수명, 인스턴스명, 메서드명과 같은 형식으로 사용

변수(Variable)
일반적인 프로그램언어의 변수와 기본 개념

메서드(Method)
일반적인 프로그램언어의 함수와 유사함. 함수는 단순한 기능을 모듈화 한것이지만 메서드는 객체의 동작을 정의함

자바 식별자(Identifier) 규칙
변수, 상수, 메서드, 클래스 등을 선언할때의 일반적인 이름 규칙 입니다.

* 첫 문자가 문자나 _, $의 특수문자로 시작되어야 한다. 숫자로 시작할 수 없다.
* 첫 문자가 아니라면, 문자나 _, $의 특수문자 그리고 숫자로 구성될 수 있다.
* 자바의 예약어는 식별자로 사용할 수 없다.
* 자바의 식별자는 대소문자를 구분한다.
* 식별자 길이는 제한이 없고 공백은 포함할 수 없다.

식별자 생성 관례(Coding convention)
문법적인 제한사항은 아니지만 일반적으로 다음과 같은 관례로 생성 합니다.

* 클래스 이름은 대문자의 명사로 시작
* 메서드 이름은 소문자의 동사
* 변수는 소문자의 명사
* 상수는 대문자의 명사
*/

// Ex) 코드

public class HelloWord{
    public static void main(String[] ages){
            System.out.println("Hello World!!")
    }
}
// 결과 Hello Wordld!! 출력